read_verilog parking.v
synth -top parking
write_blif parking_system.blif
